apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_osc.h
/* Control Register 0 (CTRL0_SET) */
#define OSC_RC_400M_CTRL0_SET_REF_CLK_DIV_SHIFT  (24)  /* Bits 24-30: Divide value for ref_clk to generate slow_clk (used inside this IP) */
#define OSC_RC_400M_CTRL0_SET_REF_CLK_DIV_MASK   (0x6 << OSC_RC_400M_CTRL0_SET_REF_CLK_DIV_SHIFT)
#define OSC_RC_400M_CTRL0_SET_REF_CLK_DIV(n)     (((n) << OSC_RC_400M_CTRL0_SET_REF_CLK_DIV_SHIFT) & OSC_RC_400M_CTRL0_SET_REF_CLK_DIV_MASK)

/* Control Register 0 (CTRL0_CLR) */
#define OSC_RC_400M_CTRL0_CLR_REF_CLK_DIV_SHIFT  (24)  /* Bits 24-30: Divide value for ref_clk to generate slow_clk (used inside this IP) */
#define OSC_RC_400M_CTRL0_CLR_REF_CLK_DIV_MASK   (0x6 << OSC_RC_400M_CTRL0_CLR_REF_CLK_DIV_SHIFT)
#define OSC_RC_400M_CTRL0_CLR_REF_CLK_DIV(n)     (((n) << OSC_RC_400M_CTRL0_CLR_REF_CLK_DIV_SHIFT) & OSC_RC_400M_CTRL0_CLR_REF_CLK_DIV_MASK)

/* Control Register 0 (CTRL0_TOG) */
#define OSC_RC_400M_CTRL0_TOG_REF_CLK_DIV_SHIFT  (24)  /* Bits 24-30: Divide value for ref_clk to generate slow_clk (used inside this IP) */
#define OSC_RC_400M_CTRL0_TOG_REF_CLK_DIV_MASK   (0x6 << OSC_RC_400M_CTRL0_TOG_REF_CLK_DIV_SHIFT)
#define OSC_RC_400M_CTRL0_TOG_REF_CLK_DIV(n)     (((n) << OSC_RC_400M_CTRL0_TOG_REF_CLK_DIV_SHIFT) & OSC_RC_400M_CTRL0_TOG_REF_CLK_DIV_MASK)

/* Control Register 1 (CTRL1) */
#define OSC_RC_400M_CTRL1_HYST_MINUS_SHIFT    (0)   /* Bits 0-4: Negative hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_HYST_MINUS_MASK     (0x4 << OSC_RC_400M_CTRL1_HYST_MINUS_SHIFT)
#define OSC_RC_400M_CTRL1_HYST_MINUS(n)       (((n) << OSC_RC_400M_CTRL1_HYST_MINUS_SHIFT) & OSC_RC_400M_CTRL1_HYST_MINUS_MASK)
#define OSC_RC_400M_CTRL1_HYST_PLUS_SHIFT     (8)   /* Bits 8-12: Positive hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_HYST_PLUS_MASK      (0x4 << OSC_RC_400M_CTRL1_HYST_PLUS_SHIFT)
#define OSC_RC_400M_CTRL1_HYST_PLUS(n)        (((n) << OSC_RC_400M_CTRL1_HYST_PLUS_SHIFT) & OSC_RC_400M_CTRL1_HYST_PLUS_MASK)
#define OSC_RC_400M_CTRL1_TARGET_COUNT_SHIFT  (16)  /* Bits 16-32: Target count for the fast clock */
#define OSC_RC_400M_CTRL1_TARGET_COUNT_MASK   (0x10 << OSC_RC_400M_CTRL1_TARGET_COUNT_SHIFT)
#define OSC_RC_400M_CTRL1_TARGET_COUNT(n)     (((n) << OSC_RC_400M_CTRL1_TARGET_COUNT_SHIFT) & OSC_RC_400M_CTRL1_TARGET_COUNT_MASK)

/* Control Register 1 (CTRL1_SET) */
#define OSC_RC_400M_CTRL1_SET_HYST_MINUS_SHIFT    (0)   /* Bits 0-4: Negative hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_SET_HYST_MINUS_MASK     (0x4 << OSC_RC_400M_CTRL1_SET_HYST_MINUS_SHIFT)
#define OSC_RC_400M_CTRL1_SET_HYST_MINUS(n)       (((n) << OSC_RC_400M_CTRL1_SET_HYST_MINUS_SHIFT) & OSC_RC_400M_CTRL1_SET_HYST_MINUS_MASK)
#define OSC_RC_400M_CTRL1_SET_HYST_PLUS_SHIFT     (8)   /* Bits 8-12: Positive hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_SET_HYST_PLUS_MASK      (0x4 << OSC_RC_400M_CTRL1_SET_HYST_PLUS_SHIFT)
#define OSC_RC_400M_CTRL1_SET_HYST_PLUS(n)        (((n) << OSC_RC_400M_CTRL1_SET_HYST_PLUS_SHIFT) & OSC_RC_400M_CTRL1_SET_HYST_PLUS_MASK)
#define OSC_RC_400M_CTRL1_SET_TARGET_COUNT_SHIFT  (16)  /* Bits 16-32: Target count for the fast clock */
#define OSC_RC_400M_CTRL1_SET_TARGET_COUNT_MASK   (0x10 << OSC_RC_400M_CTRL1_SET_TARGET_COUNT_SHIFT)
#define OSC_RC_400M_CTRL1_SET_TARGET_COUNT(n)     (((n) << OSC_RC_400M_CTRL1_SET_TARGET_COUNT_SHIFT) & OSC_RC_400M_CTRL1_SET_TARGET_COUNT_MASK)

/* Control Register 1 (CTRL1_CLR) */
#define OSC_RC_400M_CTRL1_CLR_HYST_MINUS_SHIFT    (0)   /* Bits 0-4: Negative hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_CLR_HYST_MINUS_MASK     (0x4 << OSC_RC_400M_CTRL1_CLR_HYST_MINUS_SHIFT)
#define OSC_RC_400M_CTRL1_CLR_HYST_MINUS(n)       (((n) << OSC_RC_400M_CTRL1_CLR_HYST_MINUS_SHIFT) & OSC_RC_400M_CTRL1_CLR_HYST_MINUS_MASK)
#define OSC_RC_400M_CTRL1_CLR_HYST_PLUS_SHIFT     (8)   /* Bits 8-12: Positive hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_CLR_HYST_PLUS_MASK      (0x4 << OSC_RC_400M_CTRL1_CLR_HYST_PLUS_SHIFT)
#define OSC_RC_400M_CTRL1_CLR_HYST_PLUS(n)        (((n) << OSC_RC_400M_CTRL1_CLR_HYST_PLUS_SHIFT) & OSC_RC_400M_CTRL1_CLR_HYST_PLUS_MASK)
#define OSC_RC_400M_CTRL1_CLR_TARGET_COUNT_SHIFT  (16)  /* Bits 16-32: Target count for the fast clock */
#define OSC_RC_400M_CTRL1_CLR_TARGET_COUNT_MASK   (0x10 << OSC_RC_400M_CTRL1_CLR_TARGET_COUNT_SHIFT)
#define OSC_RC_400M_CTRL1_CLR_TARGET_COUNT(n)     (((n) << OSC_RC_400M_CTRL1_CLR_TARGET_COUNT_SHIFT) & OSC_RC_400M_CTRL1_CLR_TARGET_COUNT_MASK)

/* Control Register 1 (CTRL1_TOG) */
#define OSC_RC_400M_CTRL1_TOG_HYST_MINUS_SHIFT    (0)   /* Bits 0-4: Negative hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_TOG_HYST_MINUS_MASK     (0x4 << OSC_RC_400M_CTRL1_TOG_HYST_MINUS_SHIFT)
#define OSC_RC_400M_CTRL1_TOG_HYST_MINUS(n)       (((n) << OSC_RC_400M_CTRL1_TOG_HYST_MINUS_SHIFT) & OSC_RC_400M_CTRL1_TOG_HYST_MINUS_MASK)
#define OSC_RC_400M_CTRL1_TOG_HYST_PLUS_SHIFT     (8)   /* Bits 8-12: Positive hysteresis value for the tuned clock */
#define OSC_RC_400M_CTRL1_TOG_HYST_PLUS_MASK      (0x4 << OSC_RC_400M_CTRL1_TOG_HYST_PLUS_SHIFT)
#define OSC_RC_400M_CTRL1_TOG_HYST_PLUS(n)        (((n) << OSC_RC_400M_CTRL1_TOG_HYST_PLUS_SHIFT) & OSC_RC_400M_CTRL1_TOG_HYST_PLUS_MASK)
#define OSC_RC_400M_CTRL1_TOG_TARGET_COUNT_SHIFT  (16)  /* Bits 16-32: Target count for the fast clock */
#define OSC_RC_400M_CTRL1_TOG_TARGET_COUNT_MASK   (0x10 << OSC_RC_400M_CTRL1_TOG_TARGET_COUNT_SHIFT)
#define OSC_RC_400M_CTRL1_TOG_TARGET_COUNT(n)     (((n) << OSC_RC_400M_CTRL1_TOG_TARGET_COUNT_SHIFT) & OSC_RC_400M_CTRL1_TOG_TARGET_COUNT_MASK)

/* Control Register 2 (CTRL2) */
#define OSC_RC_400M_CTRL2_TUNE_BYP            (1 << 10)  /* Bit 10: Bypass the tuning logic */
#define OSC_RC_400M_CTRL2_TUNE_EN             (1 << 12)  /* Bit 12: Freeze/Unfreeze the tuning value */
#define OSC_RC_400M_CTRL2_TUNE_START          (1 << 14)  /* Bit 14: Start/Stop tuning */
#define OSC_RC_400M_CTRL2_OSC_TUNE_VAL_SHIFT  (24)       /* Bits 24-32: Program the oscillator frequency */
#define OSC_RC_400M_CTRL2_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_CTRL2_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_CTRL2_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_CTRL2_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_CTRL2_OSC_TUNE_VAL_MASK)

/* Control Register 2 (CTRL2_SET) */
#define OSC_RC_400M_CTRL2_SET_TUNE_BYP            (1 << 10)  /* Bit 10: Bypass the tuning logic */
#define OSC_RC_400M_CTRL2_SET_TUNE_EN             (1 << 12)  /* Bit 12: Freeze/Unfreeze the tuning value */
#define OSC_RC_400M_CTRL2_SET_TUNE_START          (1 << 14)  /* Bit 14: Start/Stop tuning */
#define OSC_RC_400M_CTRL2_SET_OSC_TUNE_VAL_SHIFT  (24)       /* Bits 24-32: Program the oscillator frequency */
#define OSC_RC_400M_CTRL2_SET_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_CTRL2_SET_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_CTRL2_SET_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_CTRL2_SET_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_CTRL2_SET_OSC_TUNE_VAL_MASK)

/* Control Register 2 (CTRL2_CLR) */
#define OSC_RC_400M_CTRL2_CLR_TUNE_BYP            (1 << 10)  /* Bit 10: Bypass the tuning logic */
#define OSC_RC_400M_CTRL2_CLR_TUNE_EN             (1 << 12)  /* Bit 12: Freeze/Unfreeze the tuning value */
#define OSC_RC_400M_CTRL2_CLR_TUNE_START          (1 << 14)  /* Bit 14: Start/Stop tuning */
#define OSC_RC_400M_CTRL2_CLR_OSC_TUNE_VAL_SHIFT  (24)       /* Bits 24-32: Program the oscillator frequency */
#define OSC_RC_400M_CTRL2_CLR_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_CTRL2_CLR_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_CTRL2_CLR_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_CTRL2_CLR_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_CTRL2_CLR_OSC_TUNE_VAL_MASK)

/* Control Register 2 (CTRL2_TOG) */
#define OSC_RC_400M_CTRL2_TOG_TUNE_BYP            (1 << 10)  /* Bit 10: Bypass the tuning logic */
#define OSC_RC_400M_CTRL2_TOG_TUNE_EN             (1 << 12)  /* Bit 12: Freeze/Unfreeze the tuning value */
#define OSC_RC_400M_CTRL2_TOG_TUNE_START          (1 << 14)  /* Bit 14: Start/Stop tuning */
#define OSC_RC_400M_CTRL2_TOG_OSC_TUNE_VAL_SHIFT  (24)       /* Bits 24-32: Program the oscillator frequency */
#define OSC_RC_400M_CTRL2_TOG_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_CTRL2_TOG_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_CTRL2_TOG_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_CTRL2_TOG_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_CTRL2_TOG_OSC_TUNE_VAL_MASK)

/* Control Register 3 (CTRL3) */
#define OSC_RC_400M_CTRL3_CLR_ERR             (1 << 0)   /* Bit 0: Clear the error flag CLK1M_ERR */
#define OSC_RC_400M_CTRL3_EN_1M_CLK           (1 << 8)   /* Bit 8: Enable 1MHz output Clock */
#define OSC_RC_400M_CTRL3_MUX_1M_CLK          (1 << 10)  /* Bit 10: Select free/locked 1MHz output */
#define OSC_RC_400M_CTRL3_COUNT_1M_CLK_SHIFT  (16)       /* Bits 16-32: Count for the locked clk_1m_out */
#define OSC_RC_400M_CTRL3_COUNT_1M_CLK_MASK   (0x10 << OSC_RC_400M_CTRL3_COUNT_1M_CLK_SHIFT)
#define OSC_RC_400M_CTRL3_COUNT_1M_CLK(n)     (((n) << OSC_RC_400M_CTRL3_COUNT_1M_CLK_SHIFT) & OSC_RC_400M_CTRL3_COUNT_1M_CLK_MASK)

/* Control Register 3 (CTRL3_SET) */
#define OSC_RC_400M_CTRL3_SET_CLR_ERR             (1 << 0)   /* Bit 0: Clear the error flag CLK1M_ERR */
#define OSC_RC_400M_CTRL3_SET_EN_1M_CLK           (1 << 8)   /* Bit 8: Enable 1MHz output Clock */
#define OSC_RC_400M_CTRL3_SET_MUX_1M_CLK          (1 << 10)  /* Bit 10: Select free/locked 1MHz output */
#define OSC_RC_400M_CTRL3_SET_COUNT_1M_CLK_SHIFT  (16)       /* Bits 16-32: Count for the locked clk_1m_out */
#define OSC_RC_400M_CTRL3_SET_COUNT_1M_CLK_MASK   (0x10 << OSC_RC_400M_CTRL3_SET_COUNT_1M_CLK_SHIFT)
#define OSC_RC_400M_CTRL3_SET_COUNT_1M_CLK(n)     (((n) << OSC_RC_400M_CTRL3_SET_COUNT_1M_CLK_SHIFT) & OSC_RC_400M_CTRL3_SET_COUNT_1M_CLK_MASK)

/* Control Register 3 (CTRL3_CLR) */
#define OSC_RC_400M_CTRL3_CLR_CLR_ERR             (1 << 0)   /* Bit 0: Clear the error flag CLK1M_ERR */
#define OSC_RC_400M_CTRL3_CLR_EN_1M_CLK           (1 << 8)   /* Bit 8: Enable 1MHz output Clock */
#define OSC_RC_400M_CTRL3_CLR_MUX_1M_CLK          (1 << 10)  /* Bit 10: Select free/locked 1MHz output */
#define OSC_RC_400M_CTRL3_CLR_COUNT_1M_CLK_SHIFT  (16)       /* Bits 16-32: Count for the locked clk_1m_out */
#define OSC_RC_400M_CTRL3_CLR_COUNT_1M_CLK_MASK   (0x10 << OSC_RC_400M_CTRL3_CLR_COUNT_1M_CLK_SHIFT)
#define OSC_RC_400M_CTRL3_CLR_COUNT_1M_CLK(n)     (((n) << OSC_RC_400M_CTRL3_CLR_COUNT_1M_CLK_SHIFT) & OSC_RC_400M_CTRL3_CLR_COUNT_1M_CLK_MASK)

/* Control Register 3 (CTRL3_TOG) */
#define OSC_RC_400M_CTRL3_TOG_CLR_ERR             (1 << 0)   /* Bit 0: Clear the error flag CLK1M_ERR */
#define OSC_RC_400M_CTRL3_TOG_EN_1M_CLK           (1 << 8)   /* Bit 8: Enable 1MHz output Clock */
#define OSC_RC_400M_CTRL3_TOG_MUX_1M_CLK          (1 << 10)  /* Bit 10: Select free/locked 1MHz output */
#define OSC_RC_400M_CTRL3_TOG_COUNT_1M_CLK_SHIFT  (16)       /* Bits 16-32: Count for the locked clk_1m_out */
#define OSC_RC_400M_CTRL3_TOG_COUNT_1M_CLK_MASK   (0x10 << OSC_RC_400M_CTRL3_TOG_COUNT_1M_CLK_SHIFT)
#define OSC_RC_400M_CTRL3_TOG_COUNT_1M_CLK(n)     (((n) << OSC_RC_400M_CTRL3_TOG_COUNT_1M_CLK_SHIFT) & OSC_RC_400M_CTRL3_TOG_COUNT_1M_CLK_MASK)

/* Status Register 0 (STAT0) */
#define OSC_RC_400M_STAT0_CLK1M_ERR  (1 << 0)  /* Bit 0: Error flag for clk_1m_locked */

/* Status Register 0 (STAT0_SET) */
#define OSC_RC_400M_STAT0_SET_CLK1M_ERR  (1 << 0)  /* Bit 0: Error flag for clk_1m_locked */

