apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_osc.h
/* Status Register 0 (STAT0_CLR) */
#define OSC_RC_400M_STAT0_CLR_CLK1M_ERR  (1 << 0)  /* Bit 0: Error flag for clk_1m_locked */

/* Status Register 0 (STAT0_TOG) */
#define OSC_RC_400M_STAT0_TOG_CLK1M_ERR  (1 << 0)  /* Bit 0: Error flag for clk_1m_locked */

/* Status Register 1 (STAT1) */
#define OSC_RC_400M_STAT1_CURR_COUNT_VAL_SHIFT  (16)  /* Bits 16-32: Current count for the fast clock */
#define OSC_RC_400M_STAT1_CURR_COUNT_VAL_MASK   (0x10 << OSC_RC_400M_STAT1_CURR_COUNT_VAL_SHIFT)
#define OSC_RC_400M_STAT1_CURR_COUNT_VAL(n)     (((n) << OSC_RC_400M_STAT1_CURR_COUNT_VAL_SHIFT) & OSC_RC_400M_STAT1_CURR_COUNT_VAL_MASK)

/* Status Register 1 (STAT1_SET) */
#define OSC_RC_400M_STAT1_SET_CURR_COUNT_VAL_SHIFT  (16)  /* Bits 16-32: Current count for the fast clock */
#define OSC_RC_400M_STAT1_SET_CURR_COUNT_VAL_MASK   (0x10 << OSC_RC_400M_STAT1_SET_CURR_COUNT_VAL_SHIFT)
#define OSC_RC_400M_STAT1_SET_CURR_COUNT_VAL(n)     (((n) << OSC_RC_400M_STAT1_SET_CURR_COUNT_VAL_SHIFT) & OSC_RC_400M_STAT1_SET_CURR_COUNT_VAL_MASK)

/* Status Register 1 (STAT1_CLR) */
#define OSC_RC_400M_STAT1_CLR_CURR_COUNT_VAL_SHIFT  (16)  /* Bits 16-32: Current count for the fast clock */
#define OSC_RC_400M_STAT1_CLR_CURR_COUNT_VAL_MASK   (0x10 << OSC_RC_400M_STAT1_CLR_CURR_COUNT_VAL_SHIFT)
#define OSC_RC_400M_STAT1_CLR_CURR_COUNT_VAL(n)     (((n) << OSC_RC_400M_STAT1_CLR_CURR_COUNT_VAL_SHIFT) & OSC_RC_400M_STAT1_CLR_CURR_COUNT_VAL_MASK)

/* Status Register 1 (STAT1_TOG) */
#define OSC_RC_400M_STAT1_TOG_CURR_COUNT_VAL_SHIFT  (16)  /* Bits 16-32: Current count for the fast clock */
#define OSC_RC_400M_STAT1_TOG_CURR_COUNT_VAL_MASK   (0x10 << OSC_RC_400M_STAT1_TOG_CURR_COUNT_VAL_SHIFT)
#define OSC_RC_400M_STAT1_TOG_CURR_COUNT_VAL(n)     (((n) << OSC_RC_400M_STAT1_TOG_CURR_COUNT_VAL_SHIFT) & OSC_RC_400M_STAT1_TOG_CURR_COUNT_VAL_MASK)

/* Status Register 2 (STAT2) */
#define OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_SHIFT  (24)  /* Bits 24-32: Current tuning value used by oscillator */
#define OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_MASK)

/* Status Register 2 (STAT2_SET) */
#define OSC_RC_400M_STAT2_SET_CURR_OSC_TUNE_VAL_SHIFT  (24)  /* Bits 24-32: Current tuning value used by oscillator */
#define OSC_RC_400M_STAT2_SET_CURR_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_STAT2_SET_CURR_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_STAT2_SET_CURR_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_STAT2_SET_CURR_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_STAT2_SET_CURR_OSC_TUNE_VAL_MASK)

/* Status Register 2 (STAT2_CLR) */
#define OSC_RC_400M_STAT2_CLR_CURR_OSC_TUNE_VAL_SHIFT  (24)  /* Bits 24-32: Current tuning value used by oscillator */
#define OSC_RC_400M_STAT2_CLR_CURR_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_STAT2_CLR_CURR_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_STAT2_CLR_CURR_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_STAT2_CLR_CURR_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_STAT2_CLR_CURR_OSC_TUNE_VAL_MASK)

/* Status Register 2 (STAT2_TOG) */
#define OSC_RC_400M_STAT2_TOG_CURR_OSC_TUNE_VAL_SHIFT  (24)  /* Bits 24-32: Current tuning value used by oscillator */
#define OSC_RC_400M_STAT2_TOG_CURR_OSC_TUNE_VAL_MASK   (0x8 << OSC_RC_400M_STAT2_TOG_CURR_OSC_TUNE_VAL_SHIFT)
#define OSC_RC_400M_STAT2_TOG_CURR_OSC_TUNE_VAL(n)     (((n) << OSC_RC_400M_STAT2_TOG_CURR_OSC_TUNE_VAL_SHIFT) & OSC_RC_400M_STAT2_TOG_CURR_OSC_TUNE_VAL_MASK)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_OSC_H */
